In [3]:
import pandas as pd

# Reading data
Read the train.csv file as a pandas dataframe.

In [4]:
df=pd.read_csv('titanic/train.csv')

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Indexing
1. Create a function that returns the name of a passenger given their PassengerId.
2. Create a function that returns the PassengerId of a passenger given their Name.
3. Print a message with the ID of passenger **Montvila, Rev. Juozas** with the following format: 'The ID pf passenger Montvila, Rev. Juozas is ##'
4. Print a message with the name of the passenger with ID **42** with the following format: 'The passenger with ID 42 is X'

5. Print all information about the oldest passenger.

1.-

In [6]:
def id_to_name(df: pd.DataFrame,id:int)->str:
    """Nombre del pasajero

    Args:
        df (pd.DataFrame): Dataframe con los datos de los pasajeros
        id (int): id del pasajero

    Returns:
        str: Nombre del pasajero
    """
    return df[df['PassengerId']==id].Name.to_string(index=False)

2.-

In [7]:
def name_to_id(df: pd.DataFrame,name:str)->int:
    """ID del pasajero

    Args:
        df (pd.DataFrame): Dataframe con los datos de los pasajeros
        name (str): Id del pasajero

    Returns:
        int: ID del pasajero
    """
    return int(df[df['Name']==name].PassengerId.to_string(index=False))

3.-

In [8]:
name="Montvila, Rev. Juozas"
id=name_to_id(df,name)

In [9]:
print(f"The ID of passenger {name} is {id}")

The ID of passenger Montvila, Rev. Juozas is 887

4.-

In [10]:
id2=42
name2=id_to_name(df,id2)

In [11]:
print(f'The passenger with id {id2} is {name2}')

The passenger with id 42 is Turpin, Mrs. William John Robert (Dorothy Ann W...

5.-

In [12]:
pasajero_viejo=df.iloc[df['Age'].idxmax()]
pasajero_viejo

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

# Subseting
We are asked to share data for analysis by a third party. Since our dataset contains personal details, we only want to share with them the following information: ticket classes, fares and port of embarkation. We are asked to deliver a sample of the first 100 rows of this dataset.

6. Create and save the new dataset in **data/port_fares.csv**.

6.-

In [13]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
#df.loc[0:100, ["Ticket","Fare","Embarked"]].to_csv('titanic/port_fares.csv')

# Counting
7. We want to know if there were any survivors over the age of 60, print all of their information.
8. How many people over 60 survived?
9. What percentage of people over 60 survived?

7.-

In [15]:
sobrevivientes=df[(df['Age']>60) & (df['Survived']==1)]
sobrevivientes

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

8.-

In [16]:
len(sobrevivientes)

5

9.-

In [17]:
porcentaje=(len(sobrevivientes)/len(df))*100
porcentaje

0.5611672278338945

# Women and children first?
10. Find out if women and children were more likely to survive.

11. Write a function that returns the percentage of people that survived from a subset given as a boolean Pandas series.

10.-

In [43]:
#voy a suponer que un niño es menor a 15 años
niños=df[(df['Age']<=15) & (df['Survived']==1)]
mujeres=df[(df["Sex"]=="female") & (df["Age"]>15) & (df["Survived"]==1)]
sobrevivientes=df[df['Survived']==1]
porcentaje=(len(niños)+len(mujeres))/len(sobrevivientes)*100
porcentaje

63.74269005847953

11.-

In [19]:
def porcentaje(df=pd.DataFrame,serie=pd.Series)->float:
    """Porcentaje 

    Args:
        df (pd.Series): Serie de datos

    Returns:
        float: Porcentaje 
    """
    filtrado=df[serie]
    return (len(filtrado)/len(df))*100

In [20]:
porcentaje(df,df['Age']<=15)

9.31537598204265

# Summarizing

12. What is the median age of the passengers?
13. How many passengers embarked from each port?

14. Generate two hypotheses about how does the survival rate differ among groups of passengers. Write your code to explore both hypotheses.

12.-

In [21]:
media=df['Age'].mean()
media

29.69911764705882

13.-

In [22]:
valores=df["Embarked"].value_counts()
valores

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

14.-

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Primera Hipotesis

El conocimiento y capacidad de superviviencia se ve mas reflejado en adultos de mediana edad (21--50), comparado con niños, adolescentes (<21) y adultos mayores o personas entrantes a la tercera edad (>50). Por lo tanto, el porcentaje de supervivientes del subconjunto de adultos que sobrevivieron debe ser mayor a los aquellos de niños,adolescentes y el de adultos mayores. Asi mismo, por cuestiones culturales de la epoca, se tendria que ver una distincion marcada entre sobrevivientes masculinos y femeninos en todos los grupos.

In [42]:
adultos_H=df[(df.Age>=21) & (df.Age<=50) & (df.Survived==1) & (df.Sex=="male")]
adultos_M=df[(df.Age>=21) & (df.Age<=50) & (df.Survived==1) & (df.Sex=="female")]
niños_adolescentes_H=df[(df.Age<21) & (df.Survived==1) & (df.Sex=="male")]
niños_adolescentes_M=df[(df.Age<21) & (df.Survived==1) & (df.Sex=="female")]
tercera_edad_H=df[(df.Age>50) & (df.Survived==1) & (df.Sex=="male")]
tercera_edad_M=df[(df.Age>50) & (df.Survived==1) & (df.Sex=="female")]
datos=pd.Series([len(adultos_H),len(adultos_M),len(niños_adolescentes_H),len(niños_adolescentes_M),len(tercera_edad_H),len(tercera_edad_M)],index=["Adultos_H","Adultos_M","Niños_adolescentes_H",
                                                                                                                                                   "Niños_adolescentes_M","Tercera_edad_H",
                                                                                                                                                   "Tercera_edad_M"]).to_frame()
datos=datos.rename(columns={0:"Cantidad"})
datos

                      Cantidad
Adultos_H                   58
Adultos_M                  128
Niños_adolescentes_H        29
Niños_adolescentes_M        53
Tercera_edad_H               6
Tercera_edad_M              16

### Segunda Hipotesis
Debido al impacto del barco, el mismo no distinguio entre las clases sociales, por lo tanto, el numero de sobrevivientes entre las mismas deberia de ser muy similar

In [ ]:
valores_por_clase=df[df['Survived']==1].Pclass.value_counts().to_frame()
valores_por_clase['count']=valores_por_clase['count']/valores_por_clase['count'].sum()*100
valores_por_clase=valores_por_clase.rename(columns={'count':'Porcentaje'}).sort_values(by='Porcentaje',ascending=False)
valores_por_clase

        Porcentaje
Pclass
1        39.766082
3        34.795322
2        25.438596